[
  {
    "id": 1,
    "word": "Межсайтовый скриптинг",
    "meaning": "XSS-атаки, или атаки с использованием межсайтовых сценариев, представляют собой метод внедрения, при котором вредоносные скрипты интегрируются в веб-сайты. В случае атак XSS вредоносное содержимое доставляется пользователям путем использования языка программирования, который выполняется на стороне клиента, такого как JavaScript. Таким образом вред наноситься исключительно пользователю, а сервер работает без сбоев",
    "source": "The OWASP Foundation [Электронный ресурс]. - URL: https://owasp.org/www-community/attacks/xss/ (дата обращения 27.08.2023)."
  },
  {
    "id": 2,
    "word": "SQL-инъекции",
    "meaning": "атака с использованием SQL-инъекции состоит из внедрения SQL-запроса через входные данные от клиента в приложение. Благодаря успешному использованию SQL-инъекции злоумышленник может считывать конфиденциальные данные из базы данных, изменять данные, выполнять административные операции с базой данных, восстанавливать содержимое файла, присутствующего в файловой системе СУБД, и в некоторых случаях выдавать команды операционной системе.",
    "source": "The OWASP Foundation [Электронный ресурс]. - URL: https://owasp.org/www-community/attacks/SQL_Injection (дата обращения 27.08.2023)."
  },
  {
    "id": 3,
    "word": "CSRF",
    "meaning": "это атака, которая вынуждает конечного пользователя выполнять нежелательные действия в веб-приложении, в котором он в данный момент аутентифицирован.",
    "source": "Kombade R. D., Meshram B. B. CSRF vulnerabilities and defensive techniques //International Journal of Computer Network and Information Security. – 2012. – Т. 4. – №. 1. – С. 31."
  },
  {
    "id": 4,
    "word": "Атаки внедрения команд",
    "meaning": "это тип уязвимости в веб-приложениях, при котором злоумышленник может внедрить вредоносные команды или код в систему, используя пользовательский ввод.",
    "source": "Su Z., Wassermann G. The essence of command injection attacks in web applications //Acm Sigplan Notices. – 2006. – Т. 41. – №. 1. – С. 372-382."
  },
  {
    "id": 5,
    "word": "Use-After-Free",
    "meaning": "это уязвимость, связанная с неправильным использованием динамической памяти во время работы программы. Если после освобождения ячейки памяти программа не очищает указатель на эту память, злоумышленник может использовать ошибку для взлома программы. Данная уязвимость возникает на стороне сервера.",
    "source": "Kaspersky IT Encyclopedia [Электронный ресурс]. - URL: https://encyclopedia.kaspersky.com/glossary/use-after-free/#:~:text=Use%2DAfter%2DFree%20(UAF,error%20to%20hack%20the%20program (дата обращения 27.08.2023)."
  },
  {
    "id": 5,
    "word": "Неконтролируемая загрузка файла с опасным типом",
    "meaning": "уязвимость в веб-приложениях, позволяющая злоумышленникам загружать вредоносные файлы, такие как исполняемые программы или скрипты.",
    "source": "Riadi I., Aristianto E. I. An analysis of vulnerability web against attack unrestricted image file upload //Computer Engineering and Applications Journal. – 2016. – Т. 5. – №. 1. – С. 19-28."
  },
  {
    "id": 6,
    "word": "Неправильная проверка ввода",
    "meaning": "данная уязвимость возникает в ситуациях, когда входные данные, поступающие в приложение, не подвергаются должной проверке на предмет соответствия ожидаемым форматам, типам данных или допустимым значениям. При недостаточной проверке данных, вводимых в формы, злоумышленники могут внедрять вредоносные данные или команды, которые позволяют им проводить разнообразные виды атак.",
    "source": "Alsmadi I., Alazzam I. Websites' Input Validation and Input-Misuse-Based Attacks //2016 Cybersecurity and Cyberforensics Conference (CCC). – IEEE, 2016. – С. 113-116."
  }
]